app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    @user = User.find_by_id(session[:user_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def destroy
    session[:user_id] = nil
     @user = User.find_by_id(session[:user_id])